InformationRegisters/НастройкаПовторенияБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПовторенияБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовторениеЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПовторения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРасписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПовторенияБизнесПроцессов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого БизнесПроцесс Из Метаданные.БизнесПроцессы Цикл
		ИмяБизнесПроцесса = БизнесПроцесс.Имя;
		ТипыБизнесПроцессов.Добавить(БизнесПроцессы[ИмяБизнесПроцесса].ПустаяСсылка(), БизнесПроцесс.Синоним);
	КонецЦикла;	
	ТипыБизнесПроцессов.Вставить(0, Неопределено, НСтр("ru = 'Все повторения'; en = 'All recurrences'"));
	
	ТипБизнесПроцесса = Неопределено;
	Список.Параметры.УстановитьЗначениеПараметра("ТипБизнесПроцесса", ТипБизнесПроцесса);
	
	ПоказатьПрекращенные = Ложь;
	УстановитьОтбор(Список, ПоказатьПрекращенные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтбор(Список, Прекращенные)
	
	Если Прекращенные = Неопределено Тогда 
		Прекращенные = Ложь;
	КонецЕсли;	
	
	Если Прекращенные Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ПовторениеЗавершено");
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ПовторениеЗавершено", Ложь);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьОтбор(Список, Настройки["ПоказатьПрекращенные"]);
	
КонецПроцедуры

&НаКлиенте
Процедура Расписание(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("БизнесПроцесс", ТекущиеДанные.БизнесПроцесс);
	ОткрытьФорму("РегистрСведений.НастройкаПовторенияБизнесПроцессов.Форма.ФормаРасписания", ПараметрыФормы,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Прекратить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗавершитьНаСервере(ТекущаяСтрока);
	ОповеститьОбИзменении(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьНаСервере(ТекущаяСтрока)
	
	МенеджерЗаписи = РегистрыСведений.НастройкаПовторенияБизнесПроцессов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.БизнесПроцесс = ТекущаяСтрока.БизнесПроцесс;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда 
		МенеджерЗаписи.ПовторениеЗавершено = Истина;
		МенеджерЗаписи.Записать();
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьЗавершенныеПриИзменении(Элемент)
	
	УстановитьОтбор(Список, ПоказатьПрекращенные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Если Элементы.ТипыБизнесПроцессов.ТекущаяСтрока <> Неопределено Тогда 
		
		ТекущееЗначение = Элементы.ТипыБизнесПроцессов.ТекущиеДанные.Значение;
		Список.Параметры.УстановитьЗначениеПараметра("ТипБизнесПроцесса", ТекущееЗначение);
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТипыБизнесПроцессовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Элементы.ТипыБизнесПроцессов.ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ТекущееЗначение = Элементы.ТипыБизнесПроцессов.ТекущиеДанные.Значение;
	Если ТекущееЗначение = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
		
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипБизнесПроцесса", ТекущееЗначение);
	
	ОткрытьФорму("РегистрСведений.НастройкаПовторенияБизнесПроцессов.ФормаЗаписи", ПараметрыФормы, Элемент);
	
	
КонецПроцедуры
